Tekla.Structures.Model.GridPlane
The GridPlane class defines a user defined (possibly magnetic) plane helping in modeling work. A grid plane must
always belong to a father grid instance.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
GridPlane GridPlane = new GridPlane();
Plane plane = new Plane();
plane.Origin = new Point(6000,6000,0);
plane.AxisX = new Vector(-3000,0,0);
plane.AxisY = new Vector(0,6000,0);
GridPlane.Plane = plane;
GridPlane.IsMagnetic = true;
bool Result = false;
Result = GridPlane.Insert();
}
}

Tekla.Structures.Model.GridPlane.Plane
The plane defining the position of the grid plane.

Tekla.Structures.Model.GridPlane.Father
The father grid of the grid plane.

Tekla.Structures.Model.GridPlane.Label
The label for the grid surface.

Tekla.Structures.Model.GridPlane.IsMagnetic
Whether the grid surface is magnetic or not.

Tekla.Structures.Model.GridPlane.ExtensionLeft
The line extension on the left.

Tekla.Structures.Model.GridPlane.ExtensionRight
The line extension on the right.

Tekla.Structures.Model.GridPlane.ExtensionBelow
The line extension below.

Tekla.Structures.Model.GridPlane.ExtensionAbove
The line extension above.

Tekla.Structures.Model.GridPlane.DrawingVisibility
The visibility of the grid surface in drawings.

Tekla.Structures.Model.GridPlane.Color
The color of the grid plane. This works only in wireframe views.
The color of grid planes in rendered views can be changed using the advanced option XS_GRID_COLOR.

Tekla.Structures.Model.GridPlane.ExtensionForMagneticArea
The extension for the magnetic area.

Tekla.Structures.Model.GridPlane.#ctor
Creates a new grid plane instance.
The default values are as follows:
Plane = new Plane();
Plane.Origin = new Point(500.0, 500.0, 0.0);
Plane.AxisX  = new Vector(2000.0, 0.0, 0.0);
Plane.AxisY  = new Vector(0.0, 0.0, 2000.0);
Label = "Default";
IsMagnetic = false;
ExtensionLeft  = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;

Tekla.Structures.Model.GridPlane.#ctor(Tekla.Structures.Model.Plane,System.String)
Creates a new grid plane instance taking the plane and label as input.
Plane: The plane that defines the grid plane.
Label: The label for the grid plane.

Tekla.Structures.Model.GridPlane.Insert
Inserts the grid surface into the model.
Returns: True on success.

Tekla.Structures.Model.GridPlane.Select
Selects the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridPlane.Delete
Deletes the grid surface with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridPlane.Modify
Modifies the grid plane with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridPlane.ToStruct(Tekla.Structures.ModelInternal.dotGridPlane_t@)
Fills the struct to transport information to Core.
P: Struct to be filled

Tekla.Structures.Model.GridPlane.FromStruct(Tekla.Structures.ModelInternal.dotGridPlane_t@)
Sets the current instance from a struct transported from Core.
P: Struct get the data from